_posts/language/2016-07-09-english-versatile.html
---
layout: post
title: 单词本：英语单词 versatile
categories: [language]
tags: [English]
---

<blockquote>
<p>
I simply state that I'm a product of a <i>versatile</i> mind in a restless generation —
with every reason to throw my mind and pen in with the radicals.
</p>

<p>
&#x2013; F. Scott Fitzgerald, author of The Great Gatsby
</p>
</blockquote>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> versatile</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
versatile ['vɜː(r)sətaɪl]
</p>
<ol class="org-ol">
<li>changing or fluctuating readily :  variable &lt;a versatile disposition&gt;</li>
<li>embracing a variety of subjects, fields, or skills; also :  turning with ease from one thing to another</li>
<li>having many uses or applications &lt;versatile building material&gt;</li>
</ol>
</blockquote>

<ol class="org-ol">
<li>多变的，易波动的。 比如 versatile disposition，多变的性格。</li>
<li>多才多艺的。比如 a versatile cook, writer 多才多艺的厨师，作家。versatile mind,
多面手。</li>
<li>多用途的。比如 versatile building material 多用途建材，versatile drill 万用钻，
versatile trunk 多用途卡车。</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Etymology / 源</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
From Latin versātilis ‎(“turning easily”), from versātus, past participle of
versō ‎(“I turn, change”), frequentative of vertō ‎(“I turn”).<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</blockquote>

<p>
这个单词源自拉丁语 versātilis，容易变化的意思。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Derivation / 衍</h2>
<div class="outline-text-2" id="text-3">
<p>
从 versatile 的词源来看，vert 这个词根有 turn（转） 的意思。所以英语里很多带有词根
vert 的单词都有转的意味。比如：
</p>
<ul class="org-ul">
<li>revert： 转回到之前的状态。“svn revert” 是最近常用的 subversion 命令，用来把当前改变的文件内容全部恢复。revert to smoking when under stress 在压力下恢复了吸烟的恶习；To revert to your earlier question, &#x2026; 让我们回到刚才的问题……；
revert to type, return to a natural or an original condition 回复到自然状况，
When we smell the dirty air, we want to revert to type.</li>
<li>avert：从某物上转开。avert sth from sth, 将某物移开；avert one's eye(gaze,
glance) from the terible sight, 将目光从可怕的情景上移开不去看；He managed to
avert syspicion. 他设法避嫌。</li>
<li>divert：转到别的地方。divert sb from sth to sth, 转移某人注意力从某事到另外某事。divert traffic from one road to another, 转移车辆绕道行驶；divert sb‘s
attention, thoughts, energies 转移某人的注意力，思想和精力到别处；divert 还有消遣娱乐的意思。大概也是从转移注意力这层含义衍生而来，Childre are easily
diverted. 孩子们很容易逗乐。</li>
<li>vertebra 脊椎。脊椎动物用来支撑身体转动脑袋用。</li>
</ul>

<p>
再衍生出去的单词就更多了。
</p>

<p>
基于 divert 的有 diversion 转移，改道，消遣娱乐，转移，偏离。diversity多样性；
diverting 有趣的；diversify 多样化，diversify one‘s skills, interests；diverse
多种多样的，people from diverse cultures。
</p>

<p>
基于 avert 又有 averse 反对的， He seems to be averse to hard work. 看起来他不愿做脏活累活； aversion 厌恶感。I've always had an aversion to getting up
early. 我一直有起床气；Smoking is one of my pet aversion. 吸烟是我特别讨厌的事情。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> MultiLanguage / 异</h2>
<div class="outline-text-2" id="text-4">
<p>
渐渐地发现，只要是源自拉丁语的单词，法语基本上和英语保持高度一致。从易变，多用途这层意思上看，法语里也是 versatile<sup>fr</sup>，和英语拼写也完全一样。多才多艺在法语里写作 polyvalent<sup>fr</sup>，poly- 多，valent 能力。
</p>

<p>
德语易变的：wandlungsfähig, wendig，多用途的：vielseitig。
</p>
<ul class="org-ul">
<li>Der Schauspieler ist sehr wandlungsfähig. 演员的戏路很宽。</li>
<li>ein wandlungsfähiger Schauspieler 一个能演多种角色演员</li>
<li>Sie hat eine wandlungsfähige Stimme. 她有变化多端的歌喉。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Example / 例</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Samsung Galaxy J2 2016 launched; Versatile, large-screen Galaxy J Max also
introduced<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.</li>
<li>These are my top ten picks for the most versatile foods everyone should have
in their kitchen.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></li>
<li>The most versatile robots can climb stairs and navigate other tight
spots<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.</li>
<li>Newest Jazz players bring versatile skills to changing NBA<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wiktionary.org/wiki/versatile">https://en.wiktionary.org/wiki/versatile</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.orissadiary.com/ShowBussinessNews.asp?id=68092">http://www.orissadiary.com/ShowBussinessNews.asp?id=68092</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.onegreenplanet.org/vegan-food/versatile-foods-everyone-should-have-in-their-kitchen-and-how-to-use-them/">http://www.onegreenplanet.org/vegan-food/versatile-foods-everyone-should-have-in-their-kitchen-and-how-to-use-them/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.indiatvnews.com/news/world-bomb-carrying-robot-used-by-dallas-police-raises-new-ethical-questions-338547">http://www.indiatvnews.com/news/world-bomb-carrying-robot-used-by-dallas-police-raises-new-ethical-questions-338547</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.usatoday.com/story/sports/nba/2016/07/08/newest-jazz-players-bring-versatile-skills-to-changing-nba/86881426/">http://www.usatoday.com/story/sports/nba/2016/07/08/newest-jazz-players-bring-versatile-skills-to-changing-nba/86881426/</a>
</p></div></div>


</div>
</div>
